IRP/src/InformationRegisters/T9011S_AccountsCashAccount/T9011S_AccountsCashAccount.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9011S_AccountsCashAccount</name>
 <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
 <resources>
  <name>Account</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountTransit</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LedgerTypeVariant</name>
  <type>
   <types>CatalogRef.LedgerTypeVariants</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CashAccount</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9011S_AccountsCashAccount/RecordSetModule.bsl
Procedure OnWrite(Cancel, Replacing)
	If DataExchange.Load Then
		Return;
	EndIf;
	RefreshReusableValues();
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	For Each Record In ThisObject Do
		If ValueIsFilled(Record.Account) And Record.Account.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().AccountingError_01, Record.Account.Code), "Account", ThisObject);
		EndIf;
		If ValueIsFilled(Record.CashAccount) And Not ValueIsFilled(Record.Currency) Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().Error_047, 
				Metadata.InformationRegisters.T9011S_AccountsCashAccount.Dimensions.Currency.Synonym), "Currency", ThisObject);
		EndIf;
	EndDo;
EndProcedure
